{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%pip install neo4j\n",
    "%pip install gradio\n",
    "%pip install py2neo\n",
    "%pip install openai\n",
    "%pip install langchain-community\n",
    "%pip install langchain-google-genai\n",
    "%pip install langchain-openai\n",
    "%pip install decouple \n",
    "%pip install google-generativeai\n",
    "%pip install neo4j-driver \n",
    "%pip install spacy\n",
    "%pip install sentence-transformers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re \n",
    "import os \n",
    "import py2neo \n",
    "import openai \n",
    "import json\n",
    "import time\n",
    "import pandas as pd\n",
    "from openai import OpenAI\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "from langchain_community.llms import HuggingFaceHub\n",
    "from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "from langchain_community.embeddings import HuggingFaceEmbeddings \n",
    "import gradio as gr\n",
    "from gradio.themes.base import Base\n",
    "from gradio.themes.utils import colors, fonts, sizes\n",
    "from __future__ import annotations\n",
    "from typing import Iterable"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Replace OpenAI api key \n",
    "os.environ['GEMINI_API'] = 'AIzaSyA17Aior12olgduwtCXcXxKGcfnwUsKw2w'\n",
    "os.environ['HF_API'] = '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'\n",
    "os.environ['OPENAI_API'] = \"REPLACEWITHAPI\"\n",
    "os.environ['NEO4J_URI'] = 'neo4j+ssc://8e650769.databases.neo4j.io:7687'\n",
    "os.environ['NEO4J_USERNAME'] = 'neo4j'\n",
    "os.environ['NEO4J_PASSWORD'] = 'cLtGV_rgS78sVyURuUHq21JTNRs5T-TRKTy-dERp0Gc'\n",
    "\n",
    "gemini_api = os.getenv('GEMINI_API')\n",
    "hf_api = os.getenv(\"HF_API\")\n",
    "OPENAI_API = os.getenv(\"OPENAI_API\")\n",
    "NEO4J_URI=os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME=os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD=os.getenv(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to write data to connection ResolvedIPv4Address(('34.121.155.65', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n",
      "Failed to write data to connection IPv4Address(('8e650769.databases.neo4j.io', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Node properties:\\nDescription {text: STRING}\\nSymptoms {details: STRING}\\nInstallation {instructions: STRING}\\nName {value: STRING}\\nPrice {value: FLOAT}\\nPart {id: STRING}\\nStock {value: BOOLEAN}\\nRating {value: FLOAT}\\nReview {value: INTEGER}\\nChunk {id: STRING, embedding: LIST, text: STRING, question: STRING, query: STRING}\\nManufacturer {mid: STRING}\\nCompatible {details: STRING}\\nReplacement {details: STRING}\\nRelationship properties:\\n\\nThe relationships:\\n(:Part)-[:HAS_RATING]->(:Rating)\\n(:Part)-[:HAS_STOCK]->(:Stock)\\n(:Part)-[:HAS_NAME]->(:Name)\\n(:Part)-[:HAS_PRICE]->(:Price)\\n(:Part)-[:HAS_REVIEW]->(:Review)\\n(:Part)-[:REPLACES]->(:Replacement)\\n(:Part)-[:HAS_MANUFACTURER]->(:Manufacturer)\\n(:Part)-[:HAS_DESCRIPTION]->(:Description)\\n(:Part)-[:HAS_INSTALLATION]->(:Installation)\\n(:Part)-[:HAS_SYMPTOMS]->(:Symptoms)\\n(:Part)-[:HAS_COMPATIBLE]->(:Compatible)'"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cypher queries to create Neo4j relational model\n",
    "part_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/danayou/Chatbot-Data/main/cleaned.csv' AS row\n",
    "MERGE (p:Part {id: row.PSNumber})\n",
    "\n",
    "MERGE (n:Name {value: row.partName})\n",
    "MERGE (p)-[:HAS_NAME]->(n)\n",
    "\n",
    "MERGE (pr:Price {value: toFloat(row.partPrice)})\n",
    "MERGE (p)-[:HAS_PRICE]->(pr)\n",
    "\n",
    "MERGE (st:Stock {value: toBoolean(row.inStock)})\n",
    "MERGE (p)-[:HAS_STOCK]->(st)\n",
    "\n",
    "MERGE (rt:Rating {value: toFloat(row.partRating)})\n",
    "MERGE (p)-[:HAS_RATING]->(rt)\n",
    "\n",
    "MERGE (rw:Review {value: toInteger(row.partReviews)})\n",
    "MERGE (p)-[:HAS_REVIEW]->(rw)\n",
    "\n",
    "MERGE (mp:Manufacturer {mid: row.MPNumber})\n",
    "MERGE (p)-[:HAS_MANUFACTURER]->(mp)\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partDescription IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (d:Description {text: row.partDescription})\n",
    "    MERGE (p)-[:HAS_DESCRIPTION]->(d)\n",
    ")\n",
    "\n",
    "MERGE (i:Installation {instructions: row.partInstallation})\n",
    "MERGE (p)-[:HAS_INSTALLATION]->(i)\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partSymptoms IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (ss:Symptoms {details: row.partSymptoms})\n",
    "    MERGE (p)-[:HAS_SYMPTOMS]->(ss))\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partReplaces IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (r:Replacement {details: row.partReplaces})\n",
    "    MERGE (p)-[:REPLACES]->(r))\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partCompatible IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (c:Compatible {details: row.partCompatible})\n",
    "    MERGE (p)-[:HAS_COMPATIBLE]->(c))\n",
    "\"\"\"\n",
    "\n",
    "graph = Neo4jGraph(NEO4J_URI, NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "graph.query(part_query)\n",
    "graph.refresh_schema()\n",
    "graph.schema"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Gpt 4-o model\n",
    "openai = ChatOpenAI(\n",
    "    model=\"gpt-4o\",\n",
    "    temperature=0,\n",
    "    max_tokens=None,\n",
    "    timeout=None,\n",
    "    max_retries=2,\n",
    "    api_key=OPENAI_API, \n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Cypher query examples for prompting \n",
    "examples = [\n",
    "        {\n",
    "        \"question\": \"What models is PS11726733 compatible with?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11726733'}})-[:HAS_COMPATIBLE]->(c:Compatible) RETURN c.details\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What parts does PS10065979 replace?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS10065979'}})-[:REPLACES]->(r:Replacement) RETURN r.details\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What symptoms does part PS10065979 fix?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS10065979'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"Is PS11748190 compatible with model 2214715N710?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11748190'}})-[:HAS_COMPATIBLE]->(c:Compatible) WHERE c.details CONTAINS '2214715N710' RETURN c.details IS NOT NULL AS is_compatible\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"Does PS3496157 fix the 'leaking' symptoms?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS3496157'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"How do I install part PS11756150?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11756150'}})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What is the manufacturer number for PS11748190?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11748190'}})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\"  \n",
    "        }\n",
    "        ]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/transformers/tokenization_utils_base.py:1601: FutureWarning: `clean_up_tokenization_spaces` was not set. It will be set to `True` by default. This behavior will be depracted in transformers v4.45, and will be then set to `False` by default. For more details check this issue: https://github.com/huggingface/transformers/issues/31884\n",
      "  warnings.warn(\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (row) { ... }} {position: line: 1, column: 21, offset: 20} for query: \"UNWIND $data AS row CALL { WITH row MERGE (c:`Chunk` {id: row.id}) WITH c, row CALL db.create.setNodeVectorProperty(c, 'embedding', row.embedding) SET c.`text` = row.text SET c += row.metadata } IN TRANSACTIONS OF 1000 ROWS \"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'query': \"MATCH (p:Part {{id:'PS10065979'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\",\n",
       "  'question': 'What symptoms does part PS10065979 fix?'},\n",
       " {'query': \"MATCH (p:Part {{id:'PS3496157'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\",\n",
       "  'question': \"Does PS3496157 fix the 'leaking' symptoms?\"},\n",
       " {'query': \"MATCH (p:Part {{id:'PS3496157'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\",\n",
       "  'question': 'Does PS3496157 fix leaking?'}]"
      ]
     },
     "execution_count": 75,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Semantic similarity to select prompts \n",
    "example_prompt = PromptTemplate.from_template(\n",
    "    \"User input: {question}\\nCypher query: {query}\"\n",
    ")\n",
    "example_selector = SemanticSimilarityExampleSelector.from_examples(\n",
    "    examples,\n",
    "    HuggingFaceEmbeddings(),\n",
    "    Neo4jVector,\n",
    "    url = NEO4J_URI,\n",
    "    username = NEO4J_USERNAME,\n",
    "    password = NEO4J_PASSWORD,\n",
    "    k=3,\n",
    "    input_keys=[\"question\"],\n",
    ")\n",
    "example_selector.select_examples({\"question\": \"Does PS10065979 fix door won't close symptom?\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to write data to connection ResolvedIPv4Address(('34.121.155.65', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n",
      "Failed to write data to connection IPv4Address(('8e650769.databases.neo4j.io', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nSchema:\\ntest.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\\n\\nUser input: What symptoms does part PS10065979 fix?\\nCypher query: MATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\\n\\nUser input: Does PS3496157 fix the 'leaking' symptoms?\\nCypher query: MATCH (p:Part {id:'PS3496157'})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\\n\\nUser input: Does PS3496157 fix leaking?\\nCypher query: MATCH (p:Part {id:'PS3496157'})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\\n\\nUser input: Does PS10065979 fix door won't close symptom?\\nCypher query: \""
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Dynamic prompting\n",
    "dynamic_prompt = FewShotPromptTemplate(\n",
    "    example_selector = example_selector,\n",
    "    example_prompt = example_prompt,\n",
    "    prefix= \"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nSchema:\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables = [\"question\",\"schema\"],\n",
    ")\n",
    "dynamic_prompt.format(question=\"Does PS10065979 fix door won't close symptom?\", schema=\"test\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Backend function for chatbot \n",
    "def get_answer(question, history):\n",
    "    chain9 = GraphCypherQAChain.from_llm(graph=graph, llm=openai, cypher_prompt=dynamic_prompt, verbose=True)\n",
    "    answer = chain9.invoke(question)['result']\n",
    "    if answer == \"I don't know the answer.\":\n",
    "        fallback_message = \"I'm sorry, I couldn't understand your question. Could you please rephrase it, or let me know if you'd like to speak with a human?\"\n",
    "        return fallback_message\n",
    "    return answer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Running on local URL:  http://127.0.0.1:7879\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "huggingface/tokenizers: The current process just got forked, after parallelism has already been used. Disabling parallelism to avoid deadlocks...\n",
      "To disable this warning, you can either:\n",
      "\t- Avoid using `tokenizers` before the fork if possible\n",
      "\t- Explicitly set the environment variable TOKENIZERS_PARALLELISM=(true | false)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Running on public URL: https://3d966e979862ca2222.gradio.live\n",
      "\n",
      "This share link expires in 72 hours. For free permanent hosting and GPU upgrades, run `gradio deploy` from Terminal to deploy to Spaces (https://huggingface.co/spaces)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div><iframe src=\"https://3d966e979862ca2222.gradio.live\" width=\"100%\" height=\"500\" allow=\"autoplay; camera; microphone; clipboard-read; clipboard-write;\" frameborder=\"0\" allowfullscreen></iframe></div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mCypher query: RETURN 'Hello! How can I assist you with your Neo4j queries today?'\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Traceback (most recent call last):\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/langchain_community/graphs/neo4j_graph.py\", line 419, in query\n",
      "    data = session.run(Query(text=query, timeout=self.timeout), params)\n",
      "           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/neo4j/_sync/work/session.py\", line 314, in run\n",
      "    self._auto_result._run(\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/neo4j/_sync/work/result.py\", line 221, in _run\n",
      "    self._attach()\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/neo4j/_sync/work/result.py\", line 409, in _attach\n",
      "    self._connection.fetch_message()\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/neo4j/_sync/io/_common.py\", line 178, in inner\n",
      "    func(*args, **kwargs)\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/neo4j/_sync/io/_bolt.py\", line 860, in fetch_message\n",
      "    res = self._process_message(tag, fields)\n",
      "          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/neo4j/_sync/io/_bolt5.py\", line 370, in _process_message\n",
      "    response.on_failure(summary_metadata or {})\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/neo4j/_sync/io/_common.py\", line 245, in on_failure\n",
      "    raise Neo4jError.hydrate(**metadata)\n",
      "neo4j.exceptions.CypherSyntaxError: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'query': expected 'FOREACH', 'ALTER', 'CALL', 'USING PERIODIC COMMIT', 'CREATE', 'LOAD CSV', 'START DATABASE', 'STOP DATABASE', 'DEALLOCATE', 'DELETE', 'DENY', 'DETACH', 'DROP', 'DRYRUN', 'FINISH', 'GRANT', 'INSERT', 'MATCH', 'MERGE', 'NODETACH', 'OPTIONAL', 'REALLOCATE', 'REMOVE', 'RENAME', 'RETURN', 'REVOKE', 'ENABLE SERVER', 'SET', 'SHOW', 'TERMINATE', 'UNWIND', 'USE' or 'WITH' (line 1, column 8 (offset: 7))\n",
      "\"Cypher query: RETURN 'Hello! How can I assist you with your Neo4j queries today?'\"\n",
      "        ^}\n",
      "\n",
      "During handling of the above exception, another exception occurred:\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/gradio/queueing.py\", line 536, in process_events\n",
      "    response = await route_utils.call_process_api(\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/gradio/route_utils.py\", line 321, in call_process_api\n",
      "    output = await app.get_blocks().process_api(\n",
      "             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/gradio/blocks.py\", line 1935, in process_api\n",
      "    result = await self.call_function(\n",
      "             ^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/gradio/blocks.py\", line 1518, in call_function\n",
      "    prediction = await fn(*processed_input)\n",
      "                 ^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/gradio/utils.py\", line 793, in async_wrapper\n",
      "    response = await f(*args, **kwargs)\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/gradio/chat_interface.py\", line 623, in _submit_fn\n",
      "    response = await anyio.to_thread.run_sync(\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/anyio/to_thread.py\", line 56, in run_sync\n",
      "    return await get_async_backend().run_sync_in_worker_thread(\n",
      "           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/anyio/_backends/_asyncio.py\", line 2177, in run_sync_in_worker_thread\n",
      "    return await future\n",
      "           ^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/anyio/_backends/_asyncio.py\", line 859, in run\n",
      "    result = context.run(func, *args)\n",
      "             ^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/var/folders/4b/g57nhlh500n51njz9g6jjb8m0000gn/T/ipykernel_88868/758442432.py\", line 4, in get_answer\n",
      "    answer = chain9.invoke(question)['result']\n",
      "             ^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/langchain/chains/base.py\", line 164, in invoke\n",
      "    raise e\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/langchain/chains/base.py\", line 154, in invoke\n",
      "    self._call(inputs, run_manager=run_manager)\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/langchain_community/chains/graph_qa/cypher.py\", line 341, in _call\n",
      "    context = self.graph.query(generated_cypher)[: self.top_k]\n",
      "              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/langchain_community/graphs/neo4j_graph.py\", line 425, in query\n",
      "    raise ValueError(f\"Generated Cypher Statement is not valid\\n{e}\")\n",
      "ValueError: Generated Cypher Statement is not valid\n",
      "{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'query': expected 'FOREACH', 'ALTER', 'CALL', 'USING PERIODIC COMMIT', 'CREATE', 'LOAD CSV', 'START DATABASE', 'STOP DATABASE', 'DEALLOCATE', 'DELETE', 'DENY', 'DETACH', 'DROP', 'DRYRUN', 'FINISH', 'GRANT', 'INSERT', 'MATCH', 'MERGE', 'NODETACH', 'OPTIONAL', 'REALLOCATE', 'REMOVE', 'RENAME', 'RETURN', 'REVOKE', 'ENABLE SERVER', 'SET', 'SHOW', 'TERMINATE', 'UNWIND', 'USE' or 'WITH' (line 1, column 8 (offset: 7))\n",
      "\"Cypher query: RETURN 'Hello! How can I assist you with your Neo4j queries today?'\"\n",
      "        ^}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) \n",
      "WHERE ss.details CONTAINS 'leaking' \n",
      "RETURN ss.details IS NOT NULL AS is_compatible\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "# Chatbot interactive interface \n",
    "gr.ChatInterface(\n",
    "    get_answer,\n",
    "    chatbot=gr.Chatbot(height=200),\n",
    "    textbox=gr.Textbox(placeholder=\"Type your question here!\", container=False, scale=7),\n",
    "    title='Chat Agent for PartSelect',\n",
    "    description='Ask me anything...related to parts ^_^',\n",
    "    theme=gr.themes.Monochrome(primary_hue=gr.themes.colors.red, secondary_hue=gr.themes.colors.pink),\n",
    "    cache_examples=True,\n",
    "    retry_btn=None,\n",
    "    undo_btn=\"Delete Previous\",\n",
    "    clear_btn=\"Clear\",\n",
    ").launch(share=True)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
