{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%pip install neo4j\n",
    "%pip install gradio\n",
    "%pip install py2neo\n",
    "%pip install openai\n",
    "%pip install langchain-community\n",
    "%pip install langchain-google-genai\n",
    "%pip install langchain-openai\n",
    "%pip install decouple \n",
    "%pip install google-generativeai\n",
    "%pip install neo4j-driver \n",
    "%pip install spacy\n",
    "%pip install sentence-transformers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re \n",
    "import os \n",
    "import py2neo \n",
    "import openai \n",
    "import json\n",
    "import time\n",
    "import pandas as pd\n",
    "from openai import OpenAI\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "from langchain_community.llms import HuggingFaceHub\n",
    "from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "from langchain_community.embeddings import HuggingFaceEmbeddings \n",
    "import gradio as gr\n",
    "from gradio.themes.base import Base\n",
    "from gradio.themes.utils import colors, fonts, sizes\n",
    "from __future__ import annotations\n",
    "from typing import Iterable"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Replace OpenAI api key \n",
    "os.environ['GEMINI_API'] = 'AIzaSyA17Aior12olgduwtCXcXxKGcfnwUsKw2w'\n",
    "os.environ['HF_API'] = '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'\n",
    "os.environ['OPENAI_API'] = \"REPLACEWITHAPI\"\n",
    "os.environ['NEO4J_URI'] = 'neo4j+ssc://8e650769.databases.neo4j.io:7687'\n",
    "os.environ['NEO4J_USERNAME'] = 'neo4j'\n",
    "os.environ['NEO4J_PASSWORD'] = 'cLtGV_rgS78sVyURuUHq21JTNRs5T-TRKTy-dERp0Gc'\n",
    "\n",
    "gemini_api = os.getenv('GEMINI_API')\n",
    "hf_api = os.getenv(\"HF_API\")\n",
    "OPENAI_API = os.getenv(\"OPENAI_API\")\n",
    "NEO4J_URI=os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME=os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD=os.getenv(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Node properties:\\nDescription {text: STRING}\\nSymptoms {details: STRING}\\nInstallation {instructions: STRING}\\nName {value: STRING}\\nPrice {value: FLOAT}\\nPart {id: STRING}\\nStock {value: BOOLEAN}\\nRating {value: FLOAT}\\nReview {value: INTEGER}\\nChunk {id: STRING, embedding: LIST, text: STRING, question: STRING, query: STRING}\\nManufacturer {mid: STRING}\\nCompatible {details: STRING}\\nReplacement {details: STRING}\\nRelationship properties:\\n\\nThe relationships:\\n(:Part)-[:HAS_RATING]->(:Rating)\\n(:Part)-[:HAS_STOCK]->(:Stock)\\n(:Part)-[:HAS_NAME]->(:Name)\\n(:Part)-[:HAS_PRICE]->(:Price)\\n(:Part)-[:HAS_REVIEW]->(:Review)\\n(:Part)-[:REPLACES]->(:Replacement)\\n(:Part)-[:HAS_MANUFACTURER]->(:Manufacturer)\\n(:Part)-[:HAS_DESCRIPTION]->(:Description)\\n(:Part)-[:HAS_INSTALLATION]->(:Installation)\\n(:Part)-[:HAS_SYMPTOMS]->(:Symptoms)\\n(:Part)-[:HAS_COMPATIBLE]->(:Compatible)'"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cypher queries to create Neo4j relational model\n",
    "part_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/danayou/Chatbot-Data/main/cleaned.csv' AS row\n",
    "MERGE (p:Part {id: row.PSNumber})\n",
    "\n",
    "MERGE (n:Name {value: row.partName})\n",
    "MERGE (p)-[:HAS_NAME]->(n)\n",
    "\n",
    "MERGE (pr:Price {value: toFloat(row.partPrice)})\n",
    "MERGE (p)-[:HAS_PRICE]->(pr)\n",
    "\n",
    "MERGE (st:Stock {value: toBoolean(row.inStock)})\n",
    "MERGE (p)-[:HAS_STOCK]->(st)\n",
    "\n",
    "MERGE (rt:Rating {value: toFloat(row.partRating)})\n",
    "MERGE (p)-[:HAS_RATING]->(rt)\n",
    "\n",
    "MERGE (rw:Review {value: toInteger(row.partReviews)})\n",
    "MERGE (p)-[:HAS_REVIEW]->(rw)\n",
    "\n",
    "MERGE (mp:Manufacturer {mid: row.MPNumber})\n",
    "MERGE (p)-[:HAS_MANUFACTURER]->(mp)\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partDescription IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (d:Description {text: row.partDescription})\n",
    "    MERGE (p)-[:HAS_DESCRIPTION]->(d)\n",
    ")\n",
    "\n",
    "MERGE (i:Installation {instructions: row.partInstallation})\n",
    "MERGE (p)-[:HAS_INSTALLATION]->(i)\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partSymptoms IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (ss:Symptoms {details: row.partSymptoms})\n",
    "    MERGE (p)-[:HAS_SYMPTOMS]->(ss))\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partReplaces IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (r:Replacement {details: row.partReplaces})\n",
    "    MERGE (p)-[:REPLACES]->(r))\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partCompatible IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (c:Compatible {details: row.partCompatible})\n",
    "    MERGE (p)-[:HAS_COMPATIBLE]->(c))\n",
    "\"\"\"\n",
    "\n",
    "graph = Neo4jGraph(NEO4J_URI, NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "graph.query(part_query)\n",
    "graph.refresh_schema()\n",
    "graph.schema"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Gpt 4-o model\n",
    "openai = ChatOpenAI(\n",
    "    model=\"gpt-4o\",\n",
    "    temperature=0,\n",
    "    max_tokens=None,\n",
    "    timeout=None,\n",
    "    max_retries=2,\n",
    "    api_key=OPENAI_API, \n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Cypher query examples for prompting \n",
    "examples = [\n",
    "        {\n",
    "        \"question\": \"What models is PS11726733 compatible with?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11726733'}})-[:HAS_COMPATIBLE]->(c:Compatible) RETURN c.details\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What parts does PS10065979 replace?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS10065979'}})-[:REPLACES]->(r:Replacement) RETURN r.details\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What symptoms does part PS10065979 fix?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS10065979'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"Is PS11748190 compatible with model 2214715N710?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11748190'}})-[:HAS_COMPATIBLE]->(c:Compatible) WHERE c.details CONTAINS '2214715N710' RETURN c.details IS NOT NULL AS is_compatible\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"Does PS3496157 fix the 'leaking' symptoms?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS3496157'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"How do I install part PS11756150?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11756150'}})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What is the manufacturer number for PS11748190?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11748190'}})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\"  \n",
    "        }\n",
    "        ]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (row) { ... }} {position: line: 1, column: 21, offset: 20} for query: \"UNWIND $data AS row CALL { WITH row MERGE (c:`Chunk` {id: row.id}) WITH c, row CALL db.create.setNodeVectorProperty(c, 'embedding', row.embedding) SET c.`text` = row.text SET c += row.metadata } IN TRANSACTIONS OF 1000 ROWS \"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'query': \"MATCH (p:Part {{id:'PS10065979'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\",\n",
       "  'question': 'What symptoms does part PS10065979 fix?'},\n",
       " {'query': \"MATCH (p:Part {{id:'PS3496157'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\",\n",
       "  'question': \"Does PS3496157 fix the 'leaking' symptoms?\"},\n",
       " {'query': \"MATCH (p:Part {{id:'PS3496157'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\",\n",
       "  'question': 'Does PS3496157 fix leaking?'}]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Semantic similarity to select prompts \n",
    "example_prompt = PromptTemplate.from_template(\n",
    "    \"User input: {question}\\nCypher query: {query}\"\n",
    ")\n",
    "example_selector = SemanticSimilarityExampleSelector.from_examples(\n",
    "    examples,\n",
    "    HuggingFaceEmbeddings(),\n",
    "    Neo4jVector,\n",
    "    url = NEO4J_URI,\n",
    "    username = NEO4J_USERNAME,\n",
    "    password = NEO4J_PASSWORD,\n",
    "    k=3,\n",
    "    input_keys=[\"question\"],\n",
    ")\n",
    "example_selector.select_examples({\"question\": \"Does PS10065979 fix door won't close symptom?\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nSchema:\\ntest.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\\n\\nUser input: What symptoms does part PS10065979 fix?\\nCypher query: MATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\\n\\nUser input: Does PS3496157 fix the 'leaking' symptoms?\\nCypher query: MATCH (p:Part {id:'PS3496157'})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\\n\\nUser input: Does PS3496157 fix leaking?\\nCypher query: MATCH (p:Part {id:'PS3496157'})-[:HAS_SYMPTOMS]->(ss:Symptoms) WHERE ss.details CONTAINS 'leaking' RETURN ss.details IS NOT NULL AS is_compatible\\n\\nUser input: Does PS10065979 fix door won't close symptom?\\nCypher query: \""
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Dynamic prompting\n",
    "dynamic_prompt = FewShotPromptTemplate(\n",
    "    example_selector = example_selector,\n",
    "    example_prompt = example_prompt,\n",
    "    prefix= \"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nSchema:\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables = [\"question\",\"schema\"],\n",
    ")\n",
    "dynamic_prompt.format(question=\"Does PS10065979 fix door won't close symptom?\", schema=\"test\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Backend function for chatbot \n",
    "def get_answer(question, history):\n",
    "    chain9 = GraphCypherQAChain.from_llm(graph=graph, llm=openai, cypher_prompt=dynamic_prompt, verbose=True)\n",
    "    answer = chain9.invoke(question)['result']\n",
    "    return answer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Running on local URL:  http://127.0.0.1:7874\n",
      "Running on public URL: https://34a77447d2d9b74578.gradio.live\n",
      "\n",
      "This share link expires in 72 hours. For free permanent hosting and GPU upgrades, run `gradio deploy` from Terminal to deploy to Spaces (https://huggingface.co/spaces)\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "huggingface/tokenizers: The current process just got forked, after parallelism has already been used. Disabling parallelism to avoid deadlocks...\n",
      "To disable this warning, you can either:\n",
      "\t- Avoid using `tokenizers` before the fork if possible\n",
      "\t- Explicitly set the environment variable TOKENIZERS_PARALLELISM=(true | false)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div><iframe src=\"https://34a77447d2d9b74578.gradio.live\" width=\"100%\" height=\"500\" allow=\"autoplay; camera; microphone; clipboard-read; clipboard-write;\" frameborder=\"0\" allowfullscreen></iframe></div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) \n",
      "WHERE ss.details CONTAINS \"door won't close\" \n",
      "RETURN ss.details IS NOT NULL AS is_compatible\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'is_compatible': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_COMPATIBLE]->(c:Compatible) RETURN c.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.details': '2213222N414, 2213223N414, 2213229N414, 2214523N611, 2214545N711, 66512762K312, 66512763K312, 66512763K313, 66512769K312, 66512769K313, 66512772K312, 66512772K313, 66512772K314, 66512773K313, 66512773K314, 66512774K312, 66512774K313, 66512776K312, 66512776K314, 66512779K312, 66512779K313, 66512779K314, 66512813K313, 66513202N410, 66513202N411, 66513202N413, 66513203N410, 66513203N411, 66513203N413, 66513204N410'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=pZO1rcMwKBc'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id:'PS10065979'})-[:HAS_STOCK]->(s:Stock) RETURN s.value AS in_stock\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'in_stock': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "# Chatbot interactive interface \n",
    "gr.ChatInterface(\n",
    "    get_answer,\n",
    "    chatbot=gr.Chatbot(height=200),\n",
    "    textbox=gr.Textbox(placeholder=\"Type your question here!\", container=False, scale=7),\n",
    "    title='Chat Agent for PartSelect',\n",
    "    description='Ask me anything...related to parts ^_^',\n",
    "    theme=gr.themes.Monochrome(primary_hue=gr.themes.colors.red, secondary_hue=gr.themes.colors.pink),\n",
    "    cache_examples=True,\n",
    "    retry_btn=None,\n",
    "    undo_btn=\"Delete Previous\",\n",
    "    clear_btn=\"Clear\",\n",
    ").launch(share=True)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
