{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%pip install neo4j\n",
    "%pip install gradio\n",
    "%pip install py2neo\n",
    "%pip install openai\n",
    "%pip install langchain-community\n",
    "%pip install langchain-google-genai\n",
    "%pip install langchain-openai\n",
    "%pip install decouple \n",
    "%pip install google-generativeai\n",
    "%pip install neo4j-driver \n",
    "%pip install spacy\n",
    "%pip install sentence-transformers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re \n",
    "import os \n",
    "import py2neo \n",
    "import openai \n",
    "import json\n",
    "import time\n",
    "import pandas as pd\n",
    "from openai import OpenAI\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "from langchain_community.llms import HuggingFaceHub\n",
    "from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "from langchain_community.embeddings import HuggingFaceEmbeddings \n",
    "import gradio as gr\n",
    "from gradio.themes.base import Base\n",
    "from gradio.themes.utils import colors, fonts, sizes\n",
    "from __future__ import annotations\n",
    "from typing import Iterable"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Replace open AI api key \n",
    "os.environ['GEMINI_API'] = 'AIzaSyA17Aior12olgduwtCXcXxKGcfnwUsKw2w'\n",
    "os.environ['HF_API'] = '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'\n",
    "os.environ['OPENAI_API'] = \"REPLACEWITHAPI\"\n",
    "os.environ['NEO4J_URI'] = 'neo4j+ssc://8e650769.databases.neo4j.io:7687'\n",
    "os.environ['NEO4J_USERNAME'] = 'neo4j'\n",
    "os.environ['NEO4J_PASSWORD'] = 'cLtGV_rgS78sVyURuUHq21JTNRs5T-TRKTy-dERp0Gc'\n",
    "\n",
    "gemini_api = os.getenv('GEMINI_API')\n",
    "hf_api = os.getenv(\"HF_API\")\n",
    "OPENAI_API = os.getenv(\"OPENAI_API\")\n",
    "NEO4J_URI=os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME=os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD=os.getenv(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                            partName  partPrice  inStock  \\\n",
      "0  Dishwasher Upper Rack Adjuster Kit - White Whe...      47.79     True   \n",
      "1                         Dishwasher Rack Track Stop       7.70     True   \n",
      "2                     Dishwasher Upper Rack Adjuster      43.81     True   \n",
      "3  Dishwasher Dish Rack Adjuster Kit - Left and R...      46.62     True   \n",
      "4                          Dishwasher Rack Stop Clip       8.10     True   \n",
      "\n",
      "   partRating  partReviews    PSNumber     MPNumber  \\\n",
      "0        4.70          609  PS10065979    W10712395   \n",
      "1        4.60          118  PS11746591    WP8565925   \n",
      "2        4.75          121  PS11756150  WPW10546503   \n",
      "3        4.60         1022  PS10064063    W10712394   \n",
      "4        4.60           79  PS11750071  WPW10195622   \n",
      "\n",
      "                                     partDescription  \\\n",
      "0  This authentic Dishwasher Upper Rack Adjuster ...   \n",
      "1  The rack track stop on your dishwasher is desi...   \n",
      "2  This OEM Dishwasher Upper Rack Adjuster is a g...   \n",
      "3  This rack adjuster kit (Dishrack Adjuster Kit,...   \n",
      "4  This manufacturer-approved Rack Stop Clip is a...   \n",
      "\n",
      "                                        partSymptoms  \\\n",
      "0  Door won't close, Door latch failure, Not clea...   \n",
      "1  Door latch failure, Not cleaning dishes proper...   \n",
      "2  Door won't close, Door latch failure, Not clea...   \n",
      "3  Door won't close, Not cleaning dishes properly...   \n",
      "4  Door won't close, Door latch failure, Not clea...   \n",
      "\n",
      "                                        partReplaces  \\\n",
      "0       AP5957560, W10250159, W10350375, W10712395VP   \n",
      "1  AP6013365, 8270105, 8270106, 8524581, 8524582,...   \n",
      "2  AP6022813, W10306646, W10418314, W10546502, W1...   \n",
      "3  AP5956100, W10238418, W10253546, W10350376, W1...   \n",
      "4                AP6016778, W10195622, WPW10195622VP   \n",
      "\n",
      "                              partInstallation  \\\n",
      "0  https://www.youtube.com/watch?v=pZO1rcMwKBc   \n",
      "1  https://www.youtube.com/watch?v=siE-8HethWg   \n",
      "2  https://www.youtube.com/watch?v=d6AvOkulk_g   \n",
      "3  https://www.youtube.com/watch?v=9bsgL4OExLo   \n",
      "4  https://www.youtube.com/watch?v=Z-etBPckwcA   \n",
      "\n",
      "                                      partCompatible  \n",
      "0  2213222N414, 2213223N414, 2213229N414, 2214523...  \n",
      "1  110723120, 2212413N414, 2213092N413, 2213099N4...  \n",
      "2  2214715N710, 2214792N512, 2214793N512, 6651278...  \n",
      "3  66213042K112, 66213043K112, 66213044K112, 6621...  \n",
      "4  66213293K112, 66513042K110, 66513042K111, 6651...  \n"
     ]
    }
   ],
   "source": [
    "df = pd.read_csv('/Users/danayou/Desktop/Instalily/data/combined_file.csv')\n",
    "print(df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Description {text: STRING}\n",
      "Symptoms {details: STRING}\n",
      "Installation {instructions: STRING}\n",
      "Name {value: STRING}\n",
      "Price {value: FLOAT}\n",
      "Part {id: STRING}\n",
      "Stock {value: BOOLEAN}\n",
      "Rating {value: FLOAT}\n",
      "Review {value: INTEGER}\n",
      "Chunk {id: STRING, embedding: LIST, text: STRING, question: STRING, query: STRING}\n",
      "Manufacturer {mid: STRING}\n",
      "Compatible {details: STRING}\n",
      "Replacement {details: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Part)-[:HAS_RATING]->(:Rating)\n",
      "(:Part)-[:HAS_STOCK]->(:Stock)\n",
      "(:Part)-[:HAS_NAME]->(:Name)\n",
      "(:Part)-[:HAS_PRICE]->(:Price)\n",
      "(:Part)-[:HAS_REVIEW]->(:Review)\n",
      "(:Part)-[:REPLACES]->(:Replacement)\n",
      "(:Part)-[:HAS_MANUFACTURER]->(:Manufacturer)\n",
      "(:Part)-[:HAS_DESCRIPTION]->(:Description)\n",
      "(:Part)-[:HAS_INSTALLATION]->(:Installation)\n",
      "(:Part)-[:HAS_SYMPTOMS]->(:Symptoms)\n",
      "(:Part)-[:HAS_COMPATIBLE]->(:Compatible)\n"
     ]
    }
   ],
   "source": [
    "# Cypher queries to create Neo4j relational model\n",
    "part_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/danayou/Chatbot-Data/main/combined_file.csv' AS row\n",
    "MERGE (p:Part {id: row.PSNumber})\n",
    "\n",
    "MERGE (n:Name {value: row.partName})\n",
    "MERGE (p)-[:HAS_NAME]->(n)\n",
    "\n",
    "MERGE (pr:Price {value: toFloat(row.partPrice)})\n",
    "MERGE (p)-[:HAS_PRICE]->(pr)\n",
    "\n",
    "MERGE (st:Stock {value: toBoolean(row.inStock)})\n",
    "MERGE (p)-[:HAS_STOCK]->(st)\n",
    "\n",
    "MERGE (rt:Rating {value: toFloat(row.partRating)})\n",
    "MERGE (p)-[:HAS_RATING]->(rt)\n",
    "\n",
    "MERGE (rw:Review {value: toInteger(row.partReviews)})\n",
    "MERGE (p)-[:HAS_REVIEW]->(rw)\n",
    "\n",
    "MERGE (mp:Manufacturer {mid: row.MPNumber})\n",
    "MERGE (p)-[:HAS_MANUFACTURER]->(mp)\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partDescription IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (d:Description {text: row.partDescription})\n",
    "    MERGE (p)-[:HAS_DESCRIPTION]->(d)\n",
    ")\n",
    "\n",
    "MERGE (i:Installation {instructions: row.partInstallation})\n",
    "MERGE (p)-[:HAS_INSTALLATION]->(i)\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partSymptoms IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (ss:Symptoms {details: row.partSymptoms})\n",
    "    MERGE (p)-[:HAS_SYMPTOMS]->(ss))\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partReplaces IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (r:Replacement {details: row.partReplaces})\n",
    "    MERGE (p)-[:REPLACES]->(r))\n",
    "\n",
    "FOREACH (ignoreMe IN CASE WHEN row.partCompatible IS NOT NULL THEN [1] ELSE [] END |\n",
    "    MERGE (c:Compatible {details: row.partCompatible})\n",
    "    MERGE (p)-[:HAS_COMPATIBLE]->(c))\n",
    "\"\"\"\n",
    "\n",
    "graph = Neo4jGraph(NEO4J_URI, NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "graph.query(part_query)\n",
    "graph.refresh_schema()\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Sample questions\n",
    "questions = [\"What symptoms does part PS10065979 fix?\",\n",
    "             \"Give me the name of PS11746591.\",\n",
    "             \"How do I install part PS11756150?\",\n",
    "             \"Is PS10064063 in stock?\",\n",
    "             \"What is the star rating for PS11750071?\",\n",
    "             \"Is PS11748190 compatible with model 2214715N710?\",\n",
    "             \"What is the manufacturer part number for PS11748190?\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id: \"PS10065979\"})-[:HAS_SYMPTOMS]->(s:Symptoms)\n",
      "RETURN s.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'s.details': \"Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id: \"PS11746591\"})-[:HAS_NAME]->(n:Name)\n",
      "RETURN n.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'n.value': 'Dishwasher Rack Track Stop'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer to that question.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id: \"PS10064063\"})-[:HAS_STOCK]->(s:Stock)\n",
      "RETURN s.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'s.value': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id: \"PS11750071\"})-[:HAS_RATING]->(r:Rating)\n",
      "RETURN r.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'r.value': 4.6}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The star rating for PS11750071 is 4.6.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id: \"PS11748190\"})-[:HAS_COMPATIBLE]->(c:Compatible)\n",
      "RETURN c.details AS compatible_models, p.mid AS manufacturer_part_number\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'compatible_models': '2214715N710, 2214792N512, 2214793N512, 66512762K312, 66512763K312, 66512763K313, 66512769K312, 66512769K313, 66512772K312, 66512772K313, 66512772K314, 66512773K313, 66512773K314, 66512774K313, 66512776K312, 66512776K314, 66512779K312, 66512779K313, 66512779K314, 66512782K310, 66512782K312, 66512782K313, 66512783K311, 66512783K312, 66512783K313, 66512789K311, 66512789K312, 66512789K313, 66512793K312, 66512793K313', 'manufacturer_part_number': None}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "PS11748190 is compatible with the following models: 2214715N710, 2214792N512, 2214793N512, 66512762K312, 66512763K312, 66512763K313, 66512769K312, 66512769K313, 66512772K312, 66512772K313, 66512772K314, 66512773K313, 66512773K314, 66512774K313, 66512776K312, 66512776K314, 66512779K312, 66512779K313, 66512779K314, 66512782K310, 66512782K312, 66512782K313, 66512783K311, 66512783K312, 66512783K313, 66512789K311, 66512789K312, 66512789K313, 66512793K312, 66512793K313. I do not have information about the manufacturer part number for PS11748190.\n",
      "=======END======= \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Baseline Gemini model\n",
    "gemini = ChatGoogleGenerativeAI(model='gemini-pro', google_api_key=gemini_api, temperature=0)\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph, llm=gemini, verbose=True)\n",
    "\n",
    "for q in questions:\n",
    "    print('=======START=======')\n",
    "    print(chain.invoke(q)['result'])\n",
    "    print('=======END======= \\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id: 'PS10065979'})-[:HAS_SYMPTOMS]->(s:Symptoms)\n",
      "RETURN s.details\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'s.details': \"Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Part PS10065979 fixes the following symptoms: Door won't close, Door latch failure, Not cleaning dishes properly, and Noisy.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id: \"PS11746591\"})-[:HAS_NAME]->(n:Name)\n",
      "RETURN n.value\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'n.value': 'Dishwasher Rack Track Stop'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Dishwasher Rack Track Stop\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id: 'PS11756150'})-[:HAS_INSTALLATION]->(i:Installation)\n",
      "RETURN i.instructions\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=d6AvOkulk_g'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "You can find the installation instructions for part PS11756150 at the following link: https://www.youtube.com/watch?v=d6AvOkulk_g.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id: 'PS10064063'})-[:HAS_STOCK]->(s:Stock)\n",
      "RETURN s.value\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'s.value': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes, PS10064063 is in stock.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id: \"PS11750071\"})-[:HAS_RATING]->(r:Rating)\n",
      "RETURN r.value AS star_rating\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'star_rating': 4.6}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The star rating for PS11750071 is 4.6.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id: 'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible)\n",
      "WHERE c.details CONTAINS '2214715N710'\n",
      "RETURN p, c\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p': {'id': 'PS11748190'}, 'c': {'details': '2214715N710, 2214792N512, 2214793N512, 66512762K312, 66512763K312, 66512763K313, 66512769K312, 66512769K313, 66512772K312, 66512772K313, 66512772K314, 66512773K313, 66512773K314, 66512774K313, 66512776K312, 66512776K314, 66512779K312, 66512779K313, 66512779K314, 66512782K310, 66512782K312, 66512782K313, 66512783K311, 66512783K312, 66512783K313, 66512789K311, 66512789K312, 66512789K313, 66512793K312, 66512793K313'}}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes, PS11748190 is compatible with model 2214715N710.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id: \"PS11748190\"})-[:HAS_MANUFACTURER]->(m:Manufacturer)\n",
      "RETURN m.mid\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.mid': 'WPW10082853'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "WPW10082853\n",
      "=======END======= \n",
      "\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part)-[:HAS_COMPATIBLE]->(c:Compatible {details: \"PS11726733\"})\n",
      "RETURN p\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "# Baseline GPT model\n",
    "openai = ChatOpenAI(\n",
    "    model=\"gpt-4o\",\n",
    "    temperature=0,\n",
    "    max_tokens=None,\n",
    "    timeout=None,\n",
    "    max_retries=2,\n",
    "    api_key=OPENAI_API, \n",
    ")\n",
    "chain2 = GraphCypherQAChain.from_llm(graph=graph, llm=openai, verbose=True)\n",
    "\n",
    "for q in questions:\n",
    "    print('=======START=======')\n",
    "    print(chain2.invoke(q)['result'])\n",
    "    print('=======END======= \\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Cypher query examples for prompting \n",
    "examples = [\n",
    "        {\n",
    "        \"question\": \"What models is PS11726733 compatible with?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11726733'}})-[:HAS_COMPATIBLE]->(c:Compatible) RETURN c.details\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What parts does PS10065979 replace?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS10065979'}})-[:REPLACES]->(r:Replacement) RETURN r.details\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What symptoms does part PS10065979 fix?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS10065979'}})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"Give me the name of PS11746591.\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11746591'}})-[:HAS_NAME]->(n:Name) RETURN n.value\"\n",
    "        },\n",
    "        {\n",
    "        \"question\": \"How do I install part PS11756150?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11756150'}})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"Where is the video to install part PS11756150?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11756150'}})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"Is PS10064063 in stock?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS10064063'}})-[:HAS_STOCK]->(st:Stock) RETURN st.bool\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What is the star rating for PS11750071?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11750071'}})-[:HAS_RATING]->(rt:Rating) RETURN rt.value\"  \n",
    "        },\n",
    "        {\n",
    "        \"question\": \"What is the manufacturer number for PS11748190?\",\n",
    "        \"query\": \"MATCH (p:Part {{id:'PS11748190'}})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\"  \n",
    "        }\n",
    "        ]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n",
      "\n",
      "Schema:\n",
      "test.\n",
      "\n",
      "Below are a number of examples of questions and their corresponding Cypher queries.\n",
      "\n",
      "User input: What models is PS11726733 compatible with?\n",
      "Cypher query: MATCH (p:Part {id:'PS11726733'})-[:HAS_COMPATIBLE]->(c:Compatible) RETURN c.details\n",
      "\n",
      "User input: What parts does PS10065979 replace?\n",
      "Cypher query: MATCH (p:Part {id:'PS10065979'})-[:REPLACES]->(r:Replacement) RETURN r.details\n",
      "\n",
      "User input: What symptoms does part PS10065979 fix?\n",
      "Cypher query: MATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\n",
      "\n",
      "User input: What symptoms does part PS10065979 fix?\n",
      "Cypher query: \n"
     ]
    }
   ],
   "source": [
    "# Few shot prompting \n",
    "example_prompt = PromptTemplate.from_template(\n",
    "    \"User input: {question}\\nCypher query: {query}\"\n",
    ")\n",
    "\n",
    "# Take top 3 examples\n",
    "few_prompt = FewShotPromptTemplate(\n",
    "    examples = examples[:3],\n",
    "    example_prompt = example_prompt,\n",
    "    prefix= \"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nSchema:\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables = [\"question\",\"schema\"],\n",
    ")\n",
    "\n",
    "print(few_prompt.format(question=\"What symptoms does part PS10065979 fix?\", schema=\"test\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'ss.details': \"Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11746591'})-[:HAS_NAME]->(n:Name) RETURN n.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'n.value': 'Dishwasher Rack Track Stop'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11756150'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=d6AvOkulk_g'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I'm sorry, I don't have the answer to that question.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10064063'})-[:HAS_STOCK]->(s:Stock) RETURN s.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'s.value': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11750071'})-[:HAS_RATING]->(r:Rating) RETURN r.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'r.value': 4.6}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The star rating for PS11750071 is 4.6.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible) WHERE c.details = '2214715N710' RETURN c.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer to that question.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11748190'})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.mid': 'WPW10082853'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "=======END======= \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Gemini model with few shot prompting\n",
    "chain3 = GraphCypherQAChain.from_llm(graph=graph, llm=gemini, cypher_prompt=few_prompt, verbose=True)\n",
    "\n",
    "for q in questions:\n",
    "    print('=======START=======')\n",
    "    print(chain3.invoke(q)['result'])\n",
    "    print('=======END======= \\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'ss.details': \"Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Door won't close, Door latch failure, Not cleaning dishes properly, Noisy.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11746591'})-[:HAS_NAME]->(n:Name) RETURN n.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'n.value': 'Dishwasher Rack Track Stop'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Dishwasher Rack Track Stop\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11756150'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=d6AvOkulk_g'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "You can find the installation instructions for part PS11756150 at the following link: https://www.youtube.com/watch?v=d6AvOkulk_g.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10064063'})-[:HAS_STOCK]->(s:Stock) RETURN s.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'s.value': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes, PS10064063 is in stock.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11750071'})-[:HAS_RATING]->(r:Rating) RETURN r.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'r.value': 4.6}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The star rating for PS11750071 is 4.6.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id: 'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible)\n",
      "WHERE c.details CONTAINS '2214715N710'\n",
      "RETURN c.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.details': '2214715N710, 2214792N512, 2214793N512, 66512762K312, 66512763K312, 66512763K313, 66512769K312, 66512769K313, 66512772K312, 66512772K313, 66512772K314, 66512773K313, 66512773K314, 66512774K313, 66512776K312, 66512776K314, 66512779K312, 66512779K313, 66512779K314, 66512782K310, 66512782K312, 66512782K313, 66512783K311, 66512783K312, 66512783K313, 66512789K311, 66512789K312, 66512789K313, 66512793K312, 66512793K313'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes, PS11748190 is compatible with model 2214715N710.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11748190'})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.mid': 'WPW10082853'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The manufacturer part number for PS11748190 is WPW10082853.\n",
      "=======END======= \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Gpt model with few shot prompting\n",
    "chain4 = GraphCypherQAChain.from_llm(graph=graph, llm=openai, cypher_prompt=few_prompt, verbose=True)\n",
    "\n",
    "for q in questions:\n",
    "    print('=======START=======')\n",
    "    print(chain4.invoke(q)['result'])\n",
    "    print('=======END======= \\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/transformers/tokenization_utils_base.py:1601: FutureWarning: `clean_up_tokenization_spaces` was not set. It will be set to `True` by default. This behavior will be depracted in transformers v4.45, and will be then set to `False` by default. For more details check this issue: https://github.com/huggingface/transformers/issues/31884\n",
      "  warnings.warn(\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (row) { ... }} {position: line: 1, column: 21, offset: 20} for query: \"UNWIND $data AS row CALL { WITH row MERGE (c:`Chunk` {id: row.id}) WITH c, row CALL db.create.setNodeVectorProperty(c, 'embedding', row.embedding) SET c.`text` = row.text SET c += row.metadata } IN TRANSACTIONS OF 1000 ROWS \"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'query': \"MATCH (p:Part {{id:'PS11748190'}})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\",\n",
       "  'question': 'What is the manufacturer number for PS11748190?'},\n",
       " {'query': \"MATCH (p:Part)-[:HAS_MANUFACTURER]->(m:Manufacturer {{id:'PS11748190'}}) RETURN m.mid\",\n",
       "  'question': 'What is the manufacturer part number for PS11748190?'},\n",
       " {'query': \"MATCH (p:Part {{id:'PS11746591'}})-[:HAS_NAME]->(n:Name) RETURN n.value\",\n",
       "  'question': 'Give me the name of PS11746591.'}]"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Semantic similarity to select prompts \n",
    "example_selector = SemanticSimilarityExampleSelector.from_examples(\n",
    "    examples,\n",
    "    HuggingFaceEmbeddings(),\n",
    "    Neo4jVector,\n",
    "    url = NEO4J_URI,\n",
    "    username = NEO4J_USERNAME,\n",
    "    password = NEO4J_PASSWORD,\n",
    "    k=3,\n",
    "    input_keys=[\"question\"],\n",
    ")\n",
    "\n",
    "example_selector.select_examples({\"question\": \"What is the manufacturer number for PS11748190?\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n",
      "\n",
      "Schema:\n",
      "test.\n",
      "\n",
      "Below are a number of examples of questions and their corresponding Cypher queries.\n",
      "\n",
      "User input: What is the manufacturer number for PS11748190?\n",
      "Cypher query: MATCH (p:Part {id:'PS11748190'})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\n",
      "\n",
      "User input: What is the manufacturer part number for PS11748190?\n",
      "Cypher query: MATCH (p:Part)-[:HAS_MANUFACTURER]->(m:Manufacturer {id:'PS11748190'}) RETURN m.mid\n",
      "\n",
      "User input: Give me the name of PS11746591.\n",
      "Cypher query: MATCH (p:Part {id:'PS11746591'})-[:HAS_NAME]->(n:Name) RETURN n.value\n",
      "\n",
      "User input: What is the manufacturer number for PS11748190?\n",
      "Cypher query: \n"
     ]
    }
   ],
   "source": [
    "# Dynamic prompting\n",
    "dynamic_prompt = FewShotPromptTemplate(\n",
    "    example_selector = example_selector,\n",
    "    example_prompt = example_prompt,\n",
    "    prefix= \"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nSchema:\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables = [\"question\",\"schema\"],\n",
    ")\n",
    "\n",
    "print(dynamic_prompt.format(question=\"What is the manufacturer number for PS11748190?\", schema=\"test\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'ss.details': \"Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11746591'})-[:HAS_NAME]->(n:Name) RETURN n.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'n.value': 'Dishwasher Rack Track Stop'}]\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Retrying langchain_google_genai.chat_models._chat_with_retry.<locals>._chat_with_retry in 2.0 seconds as it raised InternalServerError: 500 An internal error has occurred. Please retry or report in https://developers.generativeai.google/guide/troubleshooting.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11756150'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=d6AvOkulk_g'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I'm sorry, I don't have the answer to that question.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: bool)} {position: line: 1, column: 69, offset: 68} for query: \"MATCH (p:Part {id:'PS10064063'})-[:HAS_STOCK]->(st:Stock) RETURN st.bool\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10064063'})-[:HAS_STOCK]->(st:Stock) RETURN st.bool\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'st.bool': None}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11750071'})-[:HAS_RATING]->(rt:Rating) RETURN rt.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'rt.value': 4.6}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The star rating for PS11750071 is 4.6.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible) WHERE c.details='2214715N710' RETURN c.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer to that question.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11748190'})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.mid': 'WPW10082853'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "=======END======= \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Gemini model with dynamic prompting\n",
    "chain5 = GraphCypherQAChain.from_llm(graph=graph, llm=gemini, cypher_prompt=dynamic_prompt, verbose=True)\n",
    "\n",
    "for q in questions:\n",
    "    print('=======START=======')\n",
    "    print(chain5.invoke(q)['result'])\n",
    "    print('=======END======= \\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'ss.details': \"Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Door won't close, Door latch failure, Not cleaning dishes properly, Noisy.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11746591'})-[:HAS_NAME]->(n:Name) RETURN n.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'n.value': 'Dishwasher Rack Track Stop'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Dishwasher Rack Track Stop\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11756150'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=d6AvOkulk_g'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "You can find the installation instructions for part PS11756150 at the following link: https://www.youtube.com/watch?v=d6AvOkulk_g.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10064063'})-[:HAS_STOCK]->(st:Stock) RETURN st.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'st.value': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes, PS10064063 is in stock.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11750071'})-[:HAS_RATING]->(rt:Rating) RETURN rt.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'rt.value': 4.6}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The star rating for PS11750071 is 4.6.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id:'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible)\n",
      "WHERE c.details CONTAINS '2214715N710'\n",
      "RETURN c.details\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.details': '2214715N710, 2214792N512, 2214793N512, 66512762K312, 66512763K312, 66512763K313, 66512769K312, 66512769K313, 66512772K312, 66512772K313, 66512772K314, 66512773K313, 66512773K314, 66512774K313, 66512776K312, 66512776K314, 66512779K312, 66512779K313, 66512779K314, 66512782K310, 66512782K312, 66512782K313, 66512783K311, 66512783K312, 66512783K313, 66512789K311, 66512789K312, 66512789K313, 66512793K312, 66512793K313'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Yes, PS11748190 is compatible with model 2214715N710.\n",
      "=======END======= \n",
      "\n",
      "=======START=======\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to write data to connection ResolvedIPv4Address(('34.121.155.65', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n",
      "Failed to write data to connection IPv4Address(('8e650769.databases.neo4j.io', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11748190'})-[:HAS_MANUFACTURER]->(m:Manufacturer) RETURN m.mid\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.mid': 'WPW10082853'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The manufacturer part number for PS11748190 is WPW10082853.\n",
      "=======END======= \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Gpt model with dynamic prompting\n",
    "chain6 = GraphCypherQAChain.from_llm(graph=graph, llm=openai, cypher_prompt=dynamic_prompt, verbose=True)\n",
    "\n",
    "for q in questions:\n",
    "    print('=======START=======')\n",
    "    print(chain6.invoke(q)['result'])\n",
    "    print('=======END======= \\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Backend function for chatbot using baseline GPT for runtime\n",
    "def get_answer(question, history):\n",
    "    answer = chain6.invoke(question)['result']\n",
    "    return answer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Running on local URL:  http://127.0.0.1:7869\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "I0000 00:00:1725236887.102692 1389162 fork_posix.cc:77] Other threads are currently calling into gRPC, skipping fork() handlers\n",
      "huggingface/tokenizers: The current process just got forked, after parallelism has already been used. Disabling parallelism to avoid deadlocks...\n",
      "To disable this warning, you can either:\n",
      "\t- Avoid using `tokenizers` before the fork if possible\n",
      "\t- Explicitly set the environment variable TOKENIZERS_PARALLELISM=(true | false)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Running on public URL: https://80b2be02c81674aa78.gradio.live\n",
      "\n",
      "This share link expires in 72 hours. For free permanent hosting and GPU upgrades, run `gradio deploy` from Terminal to deploy to Spaces (https://huggingface.co/spaces)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div><iframe src=\"https://80b2be02c81674aa78.gradio.live\" width=\"100%\" height=\"500\" allow=\"autoplay; camera; microphone; clipboard-read; clipboard-write;\" frameborder=\"0\" allowfullscreen></iframe></div>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=pZO1rcMwKBc'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11726733'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'ss.details': \"Not cleaning dishes properly, Noisy, Door won't close\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible)\n",
      "WHERE c.details CONTAINS '2214715N710'\n",
      "RETURN c.details IS NOT NULL AS is_compatible\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'is_compatible': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=pZO1rcMwKBc'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_SYMPTOMS]->(ss:Symptoms) RETURN ss.details\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'ss.details': \"Door won't close, Door latch failure, Not cleaning dishes properly, Noisy\"}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=pZO1rcMwKBc'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Part {id:'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible)\n",
      "WHERE c.details CONTAINS '2214715N710'\n",
      "RETURN c.details\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.details': '2214715N710, 2214792N512, 2214793N512, 66512762K312, 66512763K312, 66512763K313, 66512769K312, 66512769K313, 66512772K312, 66512772K313, 66512772K314, 66512773K313, 66512773K314, 66512774K313, 66512776K312, 66512776K314, 66512779K312, 66512779K313, 66512779K314, 66512782K310, 66512782K312, 66512782K313, 66512783K311, 66512783K312, 66512783K313, 66512789K311, 66512789K312, 66512789K313, 66512793K312, 66512793K313'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS11726733'})-[:HAS_NAME]->(n:Name) RETURN n.value\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'n.value': 'Dishwasher Lower Rack Wheel Kit - 8 Pack'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id:'PS10065979'})-[:HAS_INSTALLATION]->(i:Installation) RETURN i.instructions\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'i.instructions': 'https://www.youtube.com/watch?v=pZO1rcMwKBc'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Part {id: 'PS11748190'})-[:HAS_COMPATIBLE]->(c:Compatible)\n",
      "WHERE c.details CONTAINS '2214715N710'\n",
      "RETURN c.details IS NOT NULL AS is_compatible\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'is_compatible': True}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "# Chatbot interactive interface \n",
    "gr.ChatInterface(\n",
    "    get_answer,\n",
    "    chatbot=gr.Chatbot(height=200),\n",
    "    textbox=gr.Textbox(placeholder=\"Type your question here!\", container=False, scale=7),\n",
    "    title='Chat Agent for PartSelect',\n",
    "    description='Ask me anything...related to parts ^_^',\n",
    "    theme=gr.themes.Monochrome(primary_hue=gr.themes.colors.red, secondary_hue=gr.themes.colors.pink),\n",
    "    cache_examples=True,\n",
    "    retry_btn=None,\n",
    "    undo_btn=\"Delete Previous\",\n",
    "    clear_btn=\"Clear\",\n",
    ").launch(share=True)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
